# <img src="https://italiancoders.it/wp-content/uploads/2018/01/kotlin_250x250.png" alt="شعار مشروع كوتلن للمبتدئين" width="52" height="30" /> تطبيق تسجيل الدخول <img src="https://italiancoders.it/wp-content/uploads/2018/01/kotlin_250x250.png" alt="شعار مشروع كوتلن للمبتدئين" width="52" height="30" />

## 🌐 [![Português](https://img.shields.io/badge/Português-green)](https://github.com/SamuelRocha91/kotlinLoginSocial/blob/main/README.md) [![Español](https://img.shields.io/badge/Español-yellow)](https://github.com/SamuelRocha91/kotlinLoginSocial/blob/main/README_es.md) [![English](https://img.shields.io/badge/English-blue)](https://github.com/SamuelRocha91/kotlinLoginSocial/blob/main/README_en.md) [![Русский](https://img.shields.io/badge/Русский-lightgrey)](https://github.com/SamuelRocha91/kotlinLoginSocial/blob/main/README_ru.md) [![中文](https://img.shields.io/badge/中文-red)](https://github.com/SamuelRocha91/kotlinVirtualMenu) [![العربية](https://img.shields.io/badge/العربية-orange)](https://github.com/SamuelRocha91/kotlinLoginSocial/blob/main/README_ar.md)

هذا المشروع هو تطبيق أندرويد يُظهر تنفيذ نموذج تسجيل دخول مع تحقق من المدخلات وتقديم تغذية راجعة للمستخدم. تم تطويره باستخدام كوتلن ومكتبة تصميم المواد، ويشمل التطبيق ميزات أساسية مثل تحقق من البريد الإلكتروني وكلمة المرور، ومعالجة الأحداث في حقول النص.

![معاينة التطبيق](./gifs/login.gif)

## الميزات

- **تحقق من البريد الإلكتروني وكلمة المرور**: يتحقق مما إذا كان البريد الإلكتروني في التنسيق الصحيح وإذا كانت كلمة المرور تحتوي على أكثر من 4 أحرف.
- **تغذية راجعة بصرية**: تُعرض رسائل الخطأ باللون الأحمر في حقول النص عندما تكون المدخلات غير صالحة.
- **تمكين الزر**: يتم تمكين زر تسجيل الدخول فقط عندما يتم ملء كلا حقلَي الإدخال بشكل صحيح.
- **تصميم المواد**: يستخدم مكتبة تصميم المواد للحصول على مظهر عصري ومتجاوب.

## التقنيات المستخدمة

- **كوتلن**: اللغة الرئيسية المستخدمة في تطوير التطبيق.
- **Android SDK**: الأدوات وواجهات برمجة التطبيقات الخاصة بتطوير أندرويد.
- **تصميم المواد**: مكتبة للمكونات البصرية الحديثة والمتجاوبة.

## هيكل المشروع

- **MainActivity.kt**: النشاط الرئيسي حيث يتم تنفيذ منطق التحقق وتفاعل المستخدم.
- **activity_main.xml**: تخطيط واجهة المستخدم، الذي يحتوي على حقول نص وأزرار.

## كيفية التشغيل

1. استنساخ هذا المستودع على جهازك المحلي:
   ```sh
   git clone https://github.com/SamuelRocha91/kotlinLoginSocial.git
   ```

2. افتح المشروع في Android Studio.

3. قم بإنشاء وتشغيل التطبيق على محاكي أو جهاز أندرويد.

## مشاريع أخرى:

- 📜 [القائمة الافتراضية](https://github.com/SamuelRocha91/kotlinVirtualMenu/blob/main/README_ar.md)
- ☀️ [تطبيق الطقس](https://github.com/SamuelRocha91/kotlinWeatherApp/blob/main/README_ar.md)
